
/*********************************************************************************************
ЁлпРцШ:	  й╠жсЁлпР
╠Юп╢хк:	  emboss2017
╠Юп╢й╠╪Д:	2023-11-07
с╡╪Чж╖Ёж:	STM32F103C8 мБ╡©╬╖уЯ8MHz RCC╨╞йЩиХжцжВф╣72MHz   

пч╦дхуж╬:  
1- 
							
к╣цВ:
 # ╪стьакSTM32F103дз╡©╣дRCCй╠жсиХжц,╪схКакюШсц╣н╢П╤╗й╠фВ╣дясй╠╨╞йЩ║ё
*********************************************************************************************/

#include "stm32f10x.h" //STM32м╥нд╪Ч
#include "sys.h"
#include "delay.h"
#include "rtc.h"
#include "oled0561.h"
#include "stdio.h"

int main (void){//жВЁлпР
	delay_ms(1000); //ио╣Гй╠╣х╢ЩфДкШфВ╪Ч╬мпВ
	RCC_Configuration(); //о╣мЁй╠жсЁУй╪╩╞
	RTC_Config(); //й╣й╠й╠жсЁУй╪╩╞
	
	I2C_Configuration(); //I2CвэоъЁУй╪╩╞
	OLED0561_Init(); //OLEDЁУй╪╩╞
	
	while(1){

		if(RTC_Get()==0){ //╤аЁЖй╠╪Дж╣ё╛м╛й╠еп╤о╥╣╩ьж╣йг╡╩йг0ё╛╥г0й╠╤ах║╣дж╣йг╢МнС╣д║
			OLED_DISPLAY_8x16(2,4*8,ryear/10+0x30);//отй╬дЙ
			OLED_DISPLAY_8x16(2,5*8,ryear%10+0x30);//отй╬дЙ
			OLED_DISPLAY_8x16(2,6*8,'-');//

			OLED_DISPLAY_8x16(2,7*8,rmon/10+0x30);//отй╬тб
			OLED_DISPLAY_8x16(2,8*8,rmon%10+0x30);//отй╬тб
			OLED_DISPLAY_8x16(2,9*8,'-');//

			OLED_DISPLAY_8x16(2,10*8,rday/10+0x30);//отй╬ху
			OLED_DISPLAY_8x16(2,11*8,rday%10+0x30);//отй╬ху
			
			OLED_DISPLAY_8x16(4,4*8,rhour/10+0x30);//отй╬й╠
			OLED_DISPLAY_8x16(4,5*8,rhour%10+0x30);//отй╬й╠
			OLED_DISPLAY_8x16(4,6*8,':');//

			OLED_DISPLAY_8x16(4,7*8,rmin/10+0x30);//отй╬╥ж
			OLED_DISPLAY_8x16(4,8*8,rmin%10+0x30);//отй╬╥ж
			OLED_DISPLAY_8x16(4,9*8,':');//

			OLED_DISPLAY_8x16(4,10*8,rsec/10+0x30);//отй╬цК
			OLED_DISPLAY_8x16(4,11*8,rsec%10+0x30);//отй╬цК

		}
	}
}

/*********************************************************************************************
 * emboss2017
 * https://github.com/emboss2017/
*********************************************************************************************/
/*

║╬╠Да©╤╗рЕ║©
u32     a; //╤╗рЕ32н╩нч╥Ш╨е╠Да©a
u16     a; //╤╗рЕ16н╩нч╥Ш╨е╠Да©a
u8     a; //╤╗рЕ8н╩нч╥Ш╨е╠Да©a
vu32     a; //╤╗рЕрв╠Д╣д32н╩нч╥Ш╨е╠Да©a
vu16     a; //╤╗рЕрв╠Д╣д 16н╩нч╥Ш╨е╠Да©a
vu8     a; //╤╗рЕрв╠Д╣д 8н╩нч╥Ш╨е╠Да©a
uc32     a; //╤╗рЕж╩╤а╣д32н╩нч╥Ш╨е╠Да©a
uc16     a; //╤╗рЕж╩╤а ╣д16н╩нч╥Ш╨е╠Да©a
uc8     a; //╤╗рЕж╩╤а ╣д8н╩нч╥Ш╨е╠Да©a

#define ONE  1   //╨Й╤╗рЕ

delay_us(1); //ясй╠1н╒цК
delay_ms(1); //ясй╠1╨ацК
delay_s(1); //ясй╠1цК

GPIO_WriteBit(LEDPORT,LED1,(BitAction)(1)); //LED©ьжф

*/



